{"playerdata":{"name":"ond","inventory":{"knife":"You notice a knife in the room.","whiskey":"You see a whiskey bottle winking at you."},"position":"office","visited":["hallway","main hall","kitchen","living room","office"]},"gamedata":[{"name":"hallway","description":"You are standing in a dark hallway with\nlocked door behind you.\nYou have no idea how you got here. The last thing you remember is a figure\nof tall, slender man.","description_visited":"This is the hallway you started on.","items":{"letter":"There is a letter laying on the floor."},"exits":{"n":"main hall"}},{"name":"main hall","description":"The hallway opens into a big central hall. It has three other doors.\nYou feel a chill as you enter towards the center. You think you heard a creak\nin an other room but maybe your mind is playing tricks on you.","description_visited":"The main hall with three doors leading to living room, kitchen and hallway and\ndining room.","items":{},"exits":{"n":"dining room","w":"living room","e":"kitchen","s":"hallway"}},{"name":"living room","description":"You enter a surprisingly small living room. There is a sofa and a fireplace.\nNo TV, just very old transistor radio. You feel like you know this place.\nThere is a closed door to the north.","description_visited":"The living room with transistor radio.","items":{},"exits":{"n":"office","e":"main hall"}},{"name":"office","description":"Large oak office table is the dominant element in the room. Next to it\nyou see a whiskey cabinet. The table has a picture frame on it.\nThe photo was taken out from the frame. You see no other door here but\nthe one you came from.","description_visited":"The office with large oak tree.","items":{},"exits":{"s":"living room"}},{"name":"kitchen","description":"The stench almost makes you vomit. Piles and piles of dirty dishes are carefully\nbalancing in the sink. The refrigerator has rotting food in it. Kitchen has a small\nwindow overlooking the garden lush with life.","description_visited":"The messy kitchen, please let's not come back it stinks here.","items":{},"exits":{"w":"main hall"}},{"name":"dining room","description":"The dining room has to be the biggest room in the house. It has a long table \nwith empty dishes set up on it. The lights don't work here but table has candles\non it that are lit. It's as if someone was expecting you. You see no other exits\nbut the one you came from.","description_visited":"The candle-lit dining room with long table.","items":{"plate":"A pink plate is here."},"exits":{"s":"main hall"}},{"name":"death","description":"\nAs you start to read the letter you begin to notice maniacal laughter in your head.\nIt is too late to realize that you are actually reading about the slender man.\nOh my god... You feel tension in your head.\n\nBOOm. Your head explodes!\n\n","description_visited":"The story of how you died.","items":{},"exits":{"n":"another dimension"}}],"sel_dir":null,"cur_room":{"name":"office","description":"Large oak office table is the dominant element in the room. Next to it\nyou see a whiskey cabinet. The table has a picture frame on it.\nThe photo was taken out from the frame. You see no other door here but\nthe one you came from.","description_visited":"The office with large oak tree.","items":{},"exits":{"s":"living room"}}}